app/Cells/ArtikelTerkini.php

    public function render(): string
    {
        $kategoriModel = new KategoriModel();
        $artikelModel = new ArtikelModel();

        $kategori = $kategoriModel->findAll();

        $builder = $artikelModel->builder()
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->orderBy('artikel.created_at', 'DESC');

        if (!empty($this->kategori_id)) {
            $builder->where('artikel.id_kategori', $this->kategori_id);
        }

        $artikel = $builder->get(5)->getResultArray(); // ambil 5 artikel terbaru
---
SELECT *
FROM `kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`created_at` DESC
 LIMIT 5