app/Controllers/AjaxController.php

SELECT *
FROM `artikel`
---
    public function getData()
    {
        $model = new ArtikelModel();
        $data = $model->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '10'
---
    public function getDataById($id)
    {
        $artikel = new \App\Models\ArtikelModel();
        $data = $artikel->find($id);