app/Controllers/Artikel.php

SELECT *
FROM `kategori`
---
            ]);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();