app/Controllers/Artikel.php

SELECT DISTINCT `kategori`
FROM `artikel`
SELECT *
FROM `artikel`
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();

        // Ambil daftar kategori unik dari tabel artikel
        $kategoriList = $model->select('kategori')->distinct()->findAll();

        // Ambil parameter kategori dari query string
        $kategori = $this->request->getGet('kategori');

        // Filter artikel berdasarkan kategori (jika ada)
        if ($kategori) {
            $artikel = $model->where('kategori', $kategori)->findAll();
        } else {
            $artikel = $model->findAll();

SELECT *
FROM `artikel`
---
    public function main()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();