app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';

        $model = new ArtikelModel();

        if ($kategori_id) {
            // Jika ada kategori dipilih, filter artikel berdasarkan kategori_id
            $artikel = $model->getArtikelDenganKategori($kategori_id);
        } else {
            // Jika tidak, tampilkan semua artikel
            $artikel = $model->getArtikelDenganKategori();
        }

        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function view($slug)
    {
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data['artikel'] = $model->where('slug', $slug)->first();

        if (empty($data['artikel'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Cannot find the article.');
        }

        $kategori = $kategoriModel->find($data['artikel']['id_kategori']);
---
SELECT *
FROM `artikel`
WHERE `slug` = 'Artikel-ke-enam'
 LIMIT 1
SELECT *
FROM `kategori`
WHERE `kategori`.`id_kategori` = '2'

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $data = [
            'title' => $title,
            'q' => $q,
            'kategori_id' => $kategori_id,
        ];

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        // Apply search filter if keyword is provided
        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        // Apply category filter if category_id is provided
        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        // Apply pagination
        $data['artikel'] = $builder->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10


        // Fetch all categories for the filter dropdown
        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required|integer'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            if ($file && $file->isValid()) {
                $file->move(ROOTPATH . 'public/gambar');
                $gambar = $file->getName();
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $gambar,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);

            return redirect()->to('admin/artikel');
        }

        $kategoriModel = new KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`, `id_kategori`, `created_at`, `updated_at`) VALUES ('Menjaga Kesehatan di Tengah Kesibukan', 'Menjaga kesehatan di era modern bisa dimulai dari hal-hal sederhana seperti tidur cukup, makan bergizi, dan minum air yang cukup. Hindari makanan cepat saji berlebihan dan perbanyak konsumsi sayur dan buah. Jangan lupakan pentingnya manajemen stres, karena kesehatan mental juga berpengaruh besar terhadap kondisi tubuh secara keseluruhan.\r\n\r\n', 'Menjaga-Kesehatan-di-Tengah-Kesibukan', 'pexels-eberhardgross-1624496_12.jpg', '2', '2025-07-12 08:07:06', '2025-07-12 08:07:06')
SELECT *
FROM `kategori`

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('8')