app/Controllers/Home.php

    public function index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();

        $kategoriList = $model->select('kategori')->distinct()->findAll();
---
SELECT DISTINCT `kategori`
FROM `artikel`