app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'  => $this->request->getVar('isi'),
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`, `created_at`, `updated_at`) VALUES ('Teknologi itu indah', 'Apapun itu teknologi', '2025-07-20 06:19:32', '2025-07-20 06:19:32')