app/Models/artikelModel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
---
    public function getArtikelDenganKategori($kategori_id = null)
    {
        $builder = $this->db->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($kategori_id) {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        return $builder->get()->getResultArray();